[
  {
    "RecipeName": "Caesar Salad",
    "Calories": 350,
    "TotalServing": 4,
    "RecipeDescription": "A classic Caesar salad with romaine lettuce, croutons, Parmesan cheese, and Caesar dressing. For the dressing, mix together 1/4 cup of mayonnaise, 2 tablespoons of grated Parmesan cheese, 1 tablespoon of lemon juice, 1 teaspoon of Worcestershire sauce, 1 teaspoon of Dijon mustard, 1 clove of garlic (minced), and salt and pepper to taste. Toss crisp romaine lettuce leaves with the dressing until well coated. Top with homemade or store-bought croutons and additional Parmesan cheese shavings. Serve immediately as a refreshing starter or light main course.",
    "ImageUrl": "assets/images/CaesarSalad.png",
    "MakingTime": "20 mins",
    "Rating": 4.5,
    "Category": "Lunch",
    "Tags": "Recommended"
  },
  {
    "RecipeName": "Fried Shrimp",
    "Calories": 250,
    "TotalServing": 2,
    "RecipeDescription": "Crispy fried shrimp seasoned with herbs and spices, served with cocktail sauce. To make, peel and devein shrimp, then season with salt, pepper, and your choice of herbs and spices. Dredge the shrimp in flour, dip in beaten eggs, then coat with breadcrumbs. Fry in hot oil until golden brown and crispy. Serve with cocktail sauce for dipping and lemon wedges for squeezing over the shrimp. Enjoy as a delicious appetizer or main course.",
    "ImageUrl": "assets/images/FriedShrimp.png",
    "MakingTime": "25 mins",
    "Rating": 4.2,
    "Category": "Dinner",
    "Tags": "Fresh"
  },
  {
    "RecipeName": "Fettuccine Alfredo Pasta",
    "Calories": 450,
    "TotalServing": 3,
    "RecipeDescription": "Creamy fettuccine pasta tossed in a rich Alfredo sauce made with butter, cream, and Parmesan cheese. To make the sauce, melt 1/2 cup of butter in a saucepan, then add 1 cup of heavy cream and 1 cup of grated Parmesan cheese. Cook until the cheese is melted and the sauce is smooth. Toss the cooked fettuccine pasta in the sauce until well coated. Serve hot with additional Parmesan cheese and freshly ground black pepper for a decadent and satisfying meal.",
    "ImageUrl": "assets/images/FettuccineAlfredoPasta.png",
    "MakingTime": "30 mins",
    "Rating": 4.7,
    "Category": "Dinner",
    "Tags": "Recommended"
  },
  {
    "RecipeName": "Salmon With Veg",
    "Calories": 400,
    "TotalServing": 2,
    "RecipeDescription": "Grilled salmon fillet served with a side of seasoned vegetables. To make, season the salmon with salt, pepper, and lemon juice, then grill until cooked through. Serve with a medley of sautéed vegetables such as zucchini, bell peppers, and cherry tomatoes. Drizzle with olive oil and sprinkle with fresh herbs for a light and flavorful meal.",
    "ImageUrl": "assets/images/SalmonWithVeg.png",
    "MakingTime": "35 mins",
    "Rating": 4.4,
    "Category": "Dinner",
    "Tags": "Fresh"
  },
  {
    "RecipeName": "Shawarma Donar Kebab",
    "Calories": 550,
    "TotalServing": 1,
    "RecipeDescription": "Middle Eastern-style shawarma made with thinly sliced meat, wrapped in pita bread, and served with tahini sauce and veggies. To make, marinate thinly sliced meat (such as beef, lamb, or chicken) in a blend of spices, garlic, and yogurt. Cook the meat on a vertical rotisserie or grill until tender and crispy. Slice the meat and serve in a warm pita bread with tahini sauce, lettuce, tomatoes, and onions. Enjoy as a delicious and filling meal.",
    "ImageUrl": "assets/images/ShawarmaDonarKebab.png",
    "MakingTime": "40 mins",
    "Rating": 4.8,
    "Category": "Dinner",
    "Tags": "Recommended"
  },
  {
    "RecipeName": "Shrimp Chow Mein",
    "Calories": 380,
    "TotalServing": 4,
    "RecipeDescription": "Stir-fried noodles with shrimp, mixed vegetables, and a savory sauce. To make, cook shrimp in a wok with garlic, ginger, and soy sauce. Add vegetables such as bell peppers, carrots, and cabbage, then toss in cooked noodles and a sauce made from soy sauce, oyster sauce, and sesame oil. Stir-fry until everything is well combined and serve hot.",
    "ImageUrl": "assets/images/ShrimpChowmein.png",
    "MakingTime": "25 mins",
    "Rating": 4.3,
    "Category": "Lunch",
    "Tags": "Fresh"
  },
  {
    "RecipeName": "Toast Croissant",
    "Calories": 300,
    "TotalServing": 2,
    "RecipeDescription": "A delicious combination of flaky croissant slices toasted to perfection. Serve with butter and jam for a delightful breakfast or snack. To prepare, slice a croissant in half lengthwise and toast in a toaster or oven until golden brown. Spread with butter and your favorite jam or preserves for a sweet and savory treat. Enjoy with a cup of coffee or tea for a comforting start to your day.",
    "ImageUrl": "assets/images/ToastCroissantFriedEgg.png",
    "MakingTime": "15 mins",
    "Rating": 4.6,
    "Category": "Breakfast",
    "Tags": "Recommended"
  },
  {
    "RecipeName": "Mexican Steak",
    "Calories": 500,
    "TotalServing": 2,
    "RecipeDescription": "Juicy steak seasoned with Mexican spices, grilled to perfection, and served with salsa. To prepare, season the steak with a blend of chili powder, cumin, paprika, garlic powder, salt, and pepper. Grill the steak to your desired doneness, then slice and serve with fresh salsa on the side. Enjoy with rice, beans, or tortillas for a complete meal.",
    "ImageUrl": "assets/images/MexicanSteak.png",
    "MakingTime": "30 mins",
    "Rating": 4.7,
    "Category": "Dinner",
    "Tags": "Recommended"
  },
  {
    "RecipeName": "Rib Eye Steak",
    "Calories": 600,
    "TotalServing": 1,
    "RecipeDescription": "A premium cut of rib-eye steak seasoned and seared to mouthwatering perfection. To prepare, season the steak with salt and pepper. Heat a skillet over high heat and add 2 tablespoons of olive oil. Once hot, add the steak and cook for about 4-5 minutes on each side for medium-rare. Let it rest for a few minutes before serving to allow the juices to redistribute.",
    "ImageUrl": "assets/images/RibEyeSteak.png",
    "MakingTime": "25 mins",
    "Rating": 4.9,
    "Category": "Dinner",
    "Tags": "Fresh"
  },
  {
    "RecipeName": "Pancake with Strawberry",
    "Calories": 400,
    "TotalServing": 2,
    "RecipeDescription": "Fluffy pancakes topped with fresh strawberries and a drizzle of maple syrup. To make the pancakes, combine 1 cup of all-purpose flour, 2 tablespoons of sugar, 1 teaspoon of baking powder, 1/2 teaspoon of baking soda, and a pinch of salt. In another bowl, whisk together 3/4 cup of buttermilk, 1/4 cup of milk, 1 egg, and 2 tablespoons of melted butter. Combine the wet and dry ingredients, then cook 1/4 cup scoops of batter on a hot griddle. Flip when bubbles appear on the surface, then cook until golden brown. Top with fresh strawberries and maple syrup before serving.",
    "ImageUrl": "assets/images/PancakeWithStrawberry.png",
    "MakingTime": "20 mins",
    "Rating": 4.5,
    "Category": "Breakfast",
    "Tags": "Recommended"
  }
]
